In [1]:
import pandas as pd

In [2]:
import numpy as np

In [55]:
df=pd.read_csv('store sales.csv')
df

              Store  Sales_Q1  Sales_Q2  Sales_Q3  Sales_Q4
0        Delhi Mart    120000    135000    128000    142000
1    Mumbai Central    150000    160000    155000    162000
2       Chennai Hub     98000    112000    107000    115000
3   Bangalore Super     17500    182000    179000    188000
4    Kolkata Retail    110000    121000    119000    125000
5  Hyderabad Bazaar    132000    138000    141000    147000
6       Pune Outlet    101000    108000    104000    112000
7     Jaipur Corner     97000     99000    102000    108000
8    Lucknow Center     88000     94000     92000     97000
9   Ahmedabad Plaza    125000    130000    127000    133000

**Find the total sales per quarter using .sum(axis=0).**

In [32]:
df.iloc[: ,1:5].sum()

Sales_Q1    1038500
Sales_Q2    1279000
Sales_Q3    1254000
Sales_Q4    1329000
dtype: int64

**Find the maximum sales value per quarter using .max(axis=0).**

In [10]:
df.iloc[: ,1:5].max()

Sales_Q1    150000
Sales_Q2    182000
Sales_Q3    179000
Sales_Q4    188000
dtype: int64

Find the minimum sales value per quarter using .min(axis=0).

In [11]:
df.iloc[:,1:5].min()

Sales_Q1    17500
Sales_Q2    94000
Sales_Q3    92000
Sales_Q4    97000
dtype: int64


Compute the average (mean) sales per quarter using .mean(axis=0).

In [12]:
df.iloc[:,1:5].mean()

Sales_Q1    103850.0
Sales_Q2    127900.0
Sales_Q3    125400.0
Sales_Q4    132900.0
dtype: float64


Compute the median sales per quarter using .median(axis=0).

In [13]:
df.iloc[:,1:5].median()

Sales_Q1    105500.0
Sales_Q2    125500.0
Sales_Q3    123000.0
Sales_Q4    129000.0
dtype: float64


Find the mode of sales per quarter using .mode(axis=0).

In [18]:
df.iloc[:,1:5].mode()

   Sales_Q1  Sales_Q2  Sales_Q3  Sales_Q4
0     17500     94000     92000     97000
1     88000     99000    102000    108000
2     97000    108000    104000    112000
3     98000    112000    107000    115000
4    101000    121000    119000    125000
5    110000    130000    127000    133000
6    120000    135000    128000    142000
7    125000    138000    141000    147000
8    132000    160000    155000    162000
9    150000    182000    179000    188000


Find how many stores reported data for each quarter using .count(axis=0).

In [19]:
df.iloc[:,1:5].count()

Sales_Q1    10
Sales_Q2    10
Sales_Q3    10
Sales_Q4    10
dtype: int64


Identify which quarter had the highest total sales overall.

In [27]:
df.iloc[:,1:5].max()

Sales_Q1    150000
Sales_Q2    182000
Sales_Q3    179000
Sales_Q4    188000
dtype: int64

Calculate the range (max âˆ’ min) for each quarter.

In [39]:
mdf=df.iloc[:,1:5].max()
midf=df.iloc[:,1:5].min()
rdf = pd.DataFrame({
    "Max": mdf,
    "Min": midf,
    "Range": mdf - midf
})
rdf

             Max    Min   Range
Sales_Q1  150000  17500  132500
Sales_Q2  182000  94000   88000
Sales_Q3  179000  92000   87000
Sales_Q4  188000  97000   91000


Calculate the total yearly sales per store using .sum(axis=1).

In [56]:
df["total sale"] = df.iloc[:,1:5].sum(axis=1)
df

              Store  Sales_Q1  Sales_Q2  Sales_Q3  Sales_Q4  total sale
0        Delhi Mart    120000    135000    128000    142000      525000
1    Mumbai Central    150000    160000    155000    162000      627000
2       Chennai Hub     98000    112000    107000    115000      432000
3   Bangalore Super     17500    182000    179000    188000      566500
4    Kolkata Retail    110000    121000    119000    125000      475000
5  Hyderabad Bazaar    132000    138000    141000    147000      558000
6       Pune Outlet    101000    108000    104000    112000      425000
7     Jaipur Corner     97000     99000    102000    108000      406000
8    Lucknow Center     88000     94000     92000     97000      371000
9   Ahmedabad Plaza    125000    130000    127000    133000      515000


Find the quarter with the highest sales for each store using .max(axis=1).

In [44]:
df.iloc[:,1:5].max(axis=1)

0    142000
1    162000
2    115000
3    188000
4    125000
5    147000
6    112000
7    108000
8     97000
9    133000
dtype: int64

Find the quarter with the lowest sales per store using .min(axis=1)

In [45]:
df.iloc[:,1:5].min(axis=1)

0    120000
1    150000
2     98000
3     17500
4    110000
5    132000
6    101000
7     97000
8     88000
9    125000
dtype: int64


Compute the average (mean) quarterly sales for each store using .mean(axis=1).

In [64]:
df['Avg Sales']=df.iloc[:,1:5].mean(axis=1)
df

,Store,Sales_Q1,Sales_Q2,Sales_Q3,Sales_Q4,total sale,Avg Sales
0,Delhi Mart,120000,135000,128000,142000,525000,131250.0
1,Mumbai Central,150000,160000,155000,162000,627000,156750.0
2,Chennai Hub,98000,112000,107000,115000,432000,108000.0
3,Bangalore Super,17500,182000,179000,188000,566500,141625.0
4,Kolkata Retail,110000,121000,119000,125000,475000,118750.0
5,Hyderabad Bazaar,132000,138000,141000,147000,558000,139500.0
6,Pune Outlet,101000,108000,104000,112000,425000,106250.0
7,Jaipur Corner,97000,99000,102000,108000,406000,101500.0
8,Lucknow Center,88000,94000,92000,97000,371000,92750.0
9,Ahmedabad Plaza,125000,130000,127000,133000,515000,128750.0

Compute the median sales per store using .median(axis=1).

In [50]:
df.iloc[:,1:5].median(axis=1)

0    131500.0
1    157500.0
2    109500.0
3    180500.0
4    120000.0
5    139500.0
6    106000.0
7    100500.0
8     93000.0
9    128500.0
dtype: float64

Count how many quarters each store reported (use .count(axis=1)).

In [51]:
df.iloc[:,1:5].count(axis=1)

0    4
1    4
2    4
3    4
4    4
5    4
6    4
7    4
8    4
9    4
dtype: int64


Find which store had the highest yearly total sales.

In [63]:
df['total sale'].max()

np.int64(627000)

Find which store had the lowest average quarterly sales

In [65]:
df['Avg Sales'].min()

np.float64(92750.0)